rtzmicro/PMX42_TivaTM4C1294NCPDT/PMX42_TM4C1294NCPDT.c
/*
 *  Required by the Networking Stack (NDK). This array must be NULL terminated.
 *  This can be removed if NDK is not used.
 *  Double curly braces are needed to avoid GCC bug #944572
 *  https://bugs.launchpad.net/gcc-linaro/+bug/944572
 */
NIMU_DEVICE_TABLE_ENTRY NIMUDeviceTable[2] = {
    {
#if TI_EXAMPLES_PPP
        /* Use PPP driver for PPP example only */
        .init = USBSerialPPP_NIMUInit
#else
        /* Default: use Ethernet driver */
        .init = EMACSnow_NIMUInit
#endif
    },
    {NULL}
};

EMACSnow_Object emacObjects[PMX42_EMACCOUNT];

/*
 *  EMAC configuration structure
 *  Set user/company specific MAC octates. The following sets the address
 *  to ff-ff-ff-ff-ff-ff. Users need to change this to make the label on
 *  their boards.
 */
unsigned char macAddress[6] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff};

const EMACSnow_HWAttrs emacHWAttrs[PMX42_EMACCOUNT] = {
    {
        .baseAddr    = EMAC0_BASE,
        .intNum      = INT_EMAC0,
        .intPriority = (~0),
        .macAddress  = macAddress
    }
};

const EMAC_Config EMAC_config[] = {
    {
        .fxnTablePtr = &EMACSnow_fxnTable,
        .object      = &emacObjects[0],
        .hwAttrs     = &emacHWAttrs[0]
    },
    {NULL, NULL, NULL}
};

/*
 *  ======== PMX42_initEMAC ========
 */
void PMX42_initEMAC(void)
{
    memcpy(macAddress, g_sys.ui8MAC, 6);

#if 0
    uint32_t ulUser0, ulUser1;

    /* Get the MAC address */
    FlashUserGet(&ulUser0, &ulUser1);
    if ((ulUser0 != 0xffffffff) && (ulUser1 != 0xffffffff)) {
        System_printf("Using MAC address in flash\n");
        /*
         *  Convert the 24/24 split MAC address from NV ram into a 32/16 split MAC
         *  address needed to program the hardware registers, then program the MAC
         *  address into the Ethernet Controller registers.
         */
        macAddress[0] = ((ulUser0 >>  0) & 0xff);
        macAddress[1] = ((ulUser0 >>  8) & 0xff);
        macAddress[2] = ((ulUser0 >> 16) & 0xff);
        macAddress[3] = ((ulUser1 >>  0) & 0xff);
        macAddress[4] = ((ulUser1 >>  8) & 0xff);
        macAddress[5] = ((ulUser1 >> 16) & 0xff);
    }
    else if (macAddress[0] == 0xff && macAddress[1] == 0xff &&
             macAddress[2] == 0xff && macAddress[3] == 0xff &&
             macAddress[4] == 0xff && macAddress[5] == 0xff) {
        System_abort("Change the macAddress variable to match your boards MAC sticker");
    }
#endif
    // Enable peripheral EPHY0
    SysCtlPeripheralEnable(SYSCTL_PERIPH_EPHY0);

    GPIOPinConfigure(GPIO_PF0_EN0LED0);  /* PMX42_J2_GRN */
    GPIOPinTypeEthernetLED(GPIO_PORTF_BASE, GPIO_PIN_0);

    GPIOPinConfigure(GPIO_PK6_EN0LED1);  /* PMX42_J2_YEL */
    GPIOPinTypeEthernetLED(GPIO_PORTK_BASE, GPIO_PIN_6);

    /* Once EMAC_init is called, EMAC_config cannot be changed */
    EMAC_init();
}

/*
 *  =============================== GPIO ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(GPIOTiva_config, ".const:GPIOTiva_config")
#endif

#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOTiva.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in PMX42_TM4C1294NCPDT.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array.  Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {
    /* Input Interrupt pins */
    /* PMX42_BTN_SW1 */
    GPIOTiva_PN_0 | GPIO_CFG_IN_PU | GPIO_CFG_IN_INT_RISING,
    /* PMX42_BTN_SW2 */
    GPIOTiva_PN_1 | GPIO_CFG_IN_PU | GPIO_CFG_IN_INT_RISING,
    /* PMX42_BTN_SW3 */
    GPIOTiva_PN_2 | GPIO_CFG_IN_PU | GPIO_CFG_IN_INT_RISING,
    /* PMX42_BTN_SW4 */
    GPIOTiva_PN_3 | GPIO_CFG_IN_PU | GPIO_CFG_IN_INT_RISING,
    /* PMX42_BTN_SW5 */
    GPIOTiva_PN_4 | GPIO_CFG_IN_PU | GPIO_CFG_IN_INT_RISING,
    /* PMX42_BTN_SW6 */
    GPIOTiva_PN_5 | GPIO_CFG_IN_PU | GPIO_CFG_IN_INT_RISING,

    /* PMX42_SLOT1_IRQ : PL2/SLOT1_IRQ */
    GPIOTiva_PL_2 | GPIO_CFG_IN_PU,
    /* PMX42_SLOT2_IRQ : PL3/SLOT2_IRQ */
    GPIOTiva_PL_3 | GPIO_CFG_IN_PU,
    /* PMX42_SLOT3_IRQ : PL4/SLOT3_IRQ */
    GPIOTiva_PL_4 | GPIO_CFG_IN_PU,
    /* PMX42_SLOT4_IRQ PL5/SLOT4_IRQ */
    GPIOTiva_PL_5 | GPIO_CFG_IN_PU,

    /* Output pins */
    /* PMX42_STAT_LED1 */
    GPIOTiva_PP_2 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* PMX42_STAT_LED2 */
    GPIOTiva_PP_3 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,

    /* PMX42_SLOT1_GPIO_PD2 */
    GPIOTiva_PD_2 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_HIGH,
    /* PMX42_SLOT1_GPIO_PM4 */
    GPIOTiva_PM_4 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* PMX42_SLOT1_GPIO_PM5 */
    GPIOTiva_PM_5 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* PMX42_SLOT1_GPIO_PM6 */
    GPIOTiva_PM_6 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,

    /* PMX42_SLOT2_GPIO_PM2 */
    GPIOTiva_PM_2 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_HIGH,
    /* PMX42_SLOT2_GPIO_PF1 */
    GPIOTiva_PF_1 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* PMX42_SLOT2_GPIO_PF2 */
    GPIOTiva_PF_2 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* PMX42_SLOT2_GPIO_PF3 */
    GPIOTiva_PF_3 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,

    /* PMX42_SLOT3_GPIO_PQ1 */
    GPIOTiva_PQ_1 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_HIGH,

    /* PMX42_SLOT4_GPIO_PM3 */
    GPIOTiva_PM_3 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_HIGH
};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in PMX42_TM4C1294NCPDT.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
	NULL,	/* PMX42_BTN_SW1 */
    NULL, 	/* PMX42_BTN_SW2 */
    NULL,	/* PMX42_BTN_SW3 */
    NULL,	/* PMX42_BTN_SW4 */
    NULL,	/* PMX42_BTN_SW5 */
    NULL,	/* PMX42_BTN_SW6 */
    NULL,   /* PMX42_SLOT1_IRQ */
    NULL,   /* PMX42_SLOT2_IRQ */
    NULL,   /* PMX42_SLOT3_IRQ */
    NULL,   /* PMX42_SLOT4_IRQ */
};

