rtzmicro/PMX42_TivaTM4C1294NCPDT/PMX42_TM4C1294NCPDT.c
/* The device-specific GPIO_config structure */
const GPIOTiva_Config GPIOTiva_config = {
    .pinConfigs         = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks          = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks  = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority        = (~0)
};

/*
 *  ======== PMX42_initGPIO ========
 */
void PMX42_initGPIO(void)
{
    /* Setup the button GPIO input pins used */
    GPIOPinTypeGPIOInput(GPIO_PORTN_BASE,
                         GPIO_PIN_0 |                       /* BTN_SW1 */
                         GPIO_PIN_1 |                       /* BTN_SW2 */
                         GPIO_PIN_2 |                       /* BTN_SW3 */
                         GPIO_PIN_3 |                       /* BTN_SW4 */
                         GPIO_PIN_4 |                       /* BTN_SW5 */
                         GPIO_PIN_5);                       /* BTN_SW6 */

    /* Slot IRQ input pins PL2-PL5 */
    GPIOPinTypeGPIOInput(GPIO_PORTL_BASE,
                         GPIO_PIN_2 |                      /* PL2/SLOT1_IRQ */
                         GPIO_PIN_3 |                      /* PL3/SLOT2_IRQ */
                         GPIO_PIN_4 |                      /* PL4/SLOT3_IRQ */
                         GPIO_PIN_5);                      /* PL5/SLOT4_IRQ */

    /* Setup LED GPIO output pins used (PP2 & PP3) */
    GPIOPinTypeGPIOOutput(GPIO_PORTP_BASE, GPIO_PIN_2 | GPIO_PIN_3);

    /* Setup SLOT-1 : Enable for GPIOOutputs */
    GPIOPinTypeGPIOOutput(GPIO_PORTD_BASE, GPIO_PIN_2);		/* SLOT1: PD2/SLOT1_SS */
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_4);		/* SLOT1: PM4/T4CCP0   */
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_5);     /* SLOT1: PM5/T4CCP1   */
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_6);     /* SLOT1: PM6/T5CCP0   */

    /* Setup SLOT-2 : Enable for GPIOOutputs */
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_2);     /* SLOT2: PM2/SLOT2_SS */
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_1);		/* SLOT2: PF1/M0PWM1   */
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_2);		/* SLOT2: PF2/M0PWM2   */
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_3);     /* SLOT2: PF3/M0PWM3   */

    /* Setup SLOT-3 : Enable for GPIOOutputs */
    GPIOPinTypeGPIOOutput(GPIO_PORTQ_BASE, GPIO_PIN_1);     /* SLOT3: PQ1/SLOT3_SS */

    /* Setup SLOT-4 : Enable for GPIOOutputs */
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_3);		/* SLOT4: PM3/SLOT4_SS */

    /* Once GPIO_init is called, GPIO_config cannot be changed */
    GPIO_init();
}

/*
 *  =============================== I2C ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(I2C_config, ".const:I2C_config")
#pragma DATA_SECTION(i2cTivaHWAttrs, ".const:i2cTivaHWAttrs")
#endif

#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CTiva.h>

I2CTiva_Object i2cTivaObjects[PMX42_I2CCOUNT];

const I2CTiva_HWAttrs i2cTivaHWAttrs[PMX42_I2CCOUNT] = {
    {
        .baseAddr    = I2C0_BASE,
        .intNum      = INT_I2C0,
        .intPriority = (~0)
    },
    {
        .baseAddr    = I2C1_BASE,
        .intNum      = INT_I2C1,
        .intPriority = (~0)
    },
    {
        .baseAddr    = I2C2_BASE,
        .intNum      = INT_I2C2,
        .intPriority = (~0)
    },
    {
        .baseAddr    = I2C3_BASE,
        .intNum      = INT_I2C3,
        .intPriority = (~0)
    }
};

const I2C_Config I2C_config[] = {
    {
        .fxnTablePtr = &I2CTiva_fxnTable,
        .object      = &i2cTivaObjects[0],
        .hwAttrs     = &i2cTivaHWAttrs[0]
    },
    {
        .fxnTablePtr = &I2CTiva_fxnTable,
        .object      = &i2cTivaObjects[1],
        .hwAttrs     = &i2cTivaHWAttrs[1]
    },
    {
        .fxnTablePtr = &I2CTiva_fxnTable,
        .object      = &i2cTivaObjects[2],
        .hwAttrs     = &i2cTivaHWAttrs[2]
    },
    {
        .fxnTablePtr = &I2CTiva_fxnTable,
        .object      = &i2cTivaObjects[3],
        .hwAttrs     = &i2cTivaHWAttrs[3]
    },
    {NULL, NULL, NULL}
};

/*
 *  ======== PMX42_initI2C ========
 */
void PMX42_initI2C(void)
{
    /* I2C0 Init */
    /* Enable the peripheral */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C0);
    /* Configure the appropriate pins to be I2C instead of GPIO. */
    GPIOPinConfigure(GPIO_PB2_I2C0SCL);
    GPIOPinConfigure(GPIO_PB3_I2C0SDA);
    GPIOPinTypeI2CSCL(GPIO_PORTB_BASE, GPIO_PIN_2);
    GPIOPinTypeI2C(GPIO_PORTB_BASE, GPIO_PIN_3);

    /* I2C1 Init */
    /* Enable the peripheral */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C1);
    /* Configure the appropriate pins to be I2C instead of GPIO. */
    GPIOPinConfigure(GPIO_PG0_I2C1SCL);
    GPIOPinConfigure(GPIO_PG1_I2C1SDA);
    GPIOPinTypeI2CSCL(GPIO_PORTG_BASE, GPIO_PIN_0);
    GPIOPinTypeI2C(GPIO_PORTG_BASE, GPIO_PIN_1);

    /* I2C2 Init */
    /* Enable the peripheral */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C2);
    /* Configure the appropriate pins to be I2C instead of GPIO. */
    GPIOPinConfigure(GPIO_PL1_I2C2SCL);
    GPIOPinConfigure(GPIO_PL0_I2C2SDA);
    GPIOPinTypeI2CSCL(GPIO_PORTL_BASE, GPIO_PIN_1);
    GPIOPinTypeI2C(GPIO_PORTL_BASE, GPIO_PIN_0);

    /* I2C3 Init */
    /* Enable the peripheral */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C3);
    /* Configure the appropriate pins to be I2C instead of GPIO. */
    GPIOPinConfigure(GPIO_PK4_I2C3SCL);
    GPIOPinConfigure(GPIO_PK5_I2C3SDA);
    GPIOPinTypeI2CSCL(GPIO_PORTK_BASE, GPIO_PIN_4);
    GPIOPinTypeI2C(GPIO_PORTK_BASE, GPIO_PIN_5);

    I2C_init();
}

/*
 *  =============================== PWM ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(PWM_config, ".const:PWM_config")
#pragma DATA_SECTION(pwmTivaHWAttrs, ".const:pwmTivaHWAttrs")
#endif

#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTiva.h>
#include <driverlib/pwm.h>

PWMTiva_Object pwmTivaObjects[PMX42_PWMCOUNT];

