rtzmicro/PMX42_TivaTM4C1294NCPDT/PMX42_TM4C1294NCPDT.c
const PWMTiva_HWAttrs pwmTivaHWAttrs[PMX42_PWMCOUNT] = {
    {
        .baseAddr   = PWM0_BASE,
        .pwmOutput  = PWM_OUT_0,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN
    }
};

const PWM_Config PWM_config[] = {
    {
        .fxnTablePtr = &PWMTiva_fxnTable,
        .object      = &pwmTivaObjects[0],
        .hwAttrs     = &pwmTivaHWAttrs[0]
    },
    {NULL, NULL, NULL}
};

/*
 *  ======== PMX42_initPWM ========
 */
void PMX42_initPWM(void)
{
    /* Enable PWM peripherals */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);

    /*
     * Enable PWM output on GPIO pins.  PWM output is connected to an Ethernet
     * LED on the development board (D4).  The PWM configuration
     * below will disable Ethernet functionality.
     */
    GPIOPinConfigure(GPIO_PF0_M0PWM0);
    GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_0);

    PWM_init();
}

/*
 *  =============================== SDSPI ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(SDSPI_config, ".const:SDSPI_config")
#pragma DATA_SECTION(sdspiTivaHWattrs, ".const:sdspiTivaHWattrs")
#endif

#include <ti/drivers/SDSPI.h>
#include <ti/drivers/sdspi/SDSPITiva.h>

/* SDSPI objects */
SDSPITiva_Object sdspiTivaObjects[PMX42_SDSPICOUNT];

const SDSPITiva_HWAttrs sdspiTivaHWattrs[PMX42_SDSPICOUNT] = {
    {
   		/* SD Card Socket (J1) */
        .baseAddr = SSI1_BASE,

        .portSCK  = GPIO_PORTB_BASE,
        .pinSCK   = GPIO_PIN_5,
        .portMISO = GPIO_PORTE_BASE,
        .pinMISO  = GPIO_PIN_5,
        .portMOSI = GPIO_PORTE_BASE,
        .pinMOSI  = GPIO_PIN_4,
        .portCS   = GPIO_PORTK_BASE,
        .pinCS    = GPIO_PIN_7,
    },
    {
   		/* OnBoard Flash (U206) */
        .baseAddr = SSI1_BASE,

        .portSCK  = GPIO_PORTQ_BASE,
        .pinSCK   = GPIO_PIN_0,
        .portMISO = GPIO_PORTE_BASE,
        .pinMISO  = GPIO_PIN_5,
        .portMOSI = GPIO_PORTE_BASE,
        .pinMOSI  = GPIO_PIN_4,
        .portCS   = GPIO_PORTK_BASE,
        .pinCS    = GPIO_PIN_4,
    }
};

const SDSPI_Config SDSPI_config[] = {
    {
        .fxnTablePtr = &SDSPITiva_fxnTable,
        .object      = &sdspiTivaObjects[0],
        .hwAttrs     = &sdspiTivaHWattrs[0]
    },
    {
        .fxnTablePtr = &SDSPITiva_fxnTable,
        .object      = &sdspiTivaObjects[1],
        .hwAttrs     = &sdspiTivaHWattrs[1]
    },
    {NULL, NULL, NULL}
};

/*
 *  ======== PMX42_initSDSPI ========
 */
void PMX42_initSDSPI(void)
{
    /* Enable SD SSI peripherals */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI1);

    /* SSI-1 Configure Pins (must be done first!) */

    // Enable pin PE5 for SSI1 SSI1XDAT1
    GPIOPinConfigure(GPIO_PE5_SSI1XDAT1);
    GPIOPinTypeSSI(GPIO_PORTE_BASE, GPIO_PIN_5);

    // Enable pin PE4 for SSI1 SSI1XDAT0
    GPIOPinConfigure(GPIO_PE4_SSI1XDAT0);
    GPIOPinTypeSSI(GPIO_PORTE_BASE, GPIO_PIN_4);

    // Enable pin PB5 for SSI1 SSI1CLK
    GPIOPinConfigure(GPIO_PB5_SSI1CLK);
    GPIOPinTypeSSI(GPIO_PORTB_BASE, GPIO_PIN_5);

    // Enable pin PB4 for SSI1 SSI1FSS
    GPIOPinConfigure(GPIO_PB4_SSI1FSS);
    GPIOPinTypeSSI(GPIO_PORTB_BASE, GPIO_PIN_4);

    /* Now, configure the pad settings */

    /* SCK (PB5) */
    GPIOPadConfigSet(GPIO_PORTB_BASE,
                     GPIO_PIN_5,
                     GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD);
    /* MOSI (PE4) */
    GPIOPadConfigSet(GPIO_PORTE_BASE,
                     GPIO_PIN_4,
                     GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD);
    /* MISO (PE5) */
    GPIOPadConfigSet(GPIO_PORTE_BASE,
                     GPIO_PIN_5,
                     GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD_WPU);
    /* CS (PB4) */
    GPIOPadConfigSet(GPIO_PORTB_BASE,
                     GPIO_PIN_4,
                     GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD);

    SDSPI_init();
}


/*
 *  =============================== SPI ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(SPI_config, ".const:SPI_config")
#pragma DATA_SECTION(spiTivaDMAHWAttrs, ".const:spiTivaDMAHWAttrs")
#endif

#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPITivaDMA.h>

/* SPI objects */
SPITivaDMA_Object spiTivaDMAObjects[PMX42_SPICOUNT];
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_ALIGN(spiTivaDMAscratchBuf, 32)
#elif defined(__IAR_SYSTEMS_ICC__)
#pragma data_alignment=32
#elif defined(__GNUC__)
__attribute__ ((aligned (32)))
#endif
uint32_t spiTivaDMAscratchBuf[PMX42_SPICOUNT];

const SPITivaDMA_HWAttrs spiTivaDMAHWAttrs[PMX42_SPICOUNT] = {
    {
        .baseAddr               = SSI2_BASE,
        .intNum                 = INT_SSI2,
        .intPriority            = (~0),
        .scratchBufPtr          = &spiTivaDMAscratchBuf[0],
        .defaultTxBufValue      = 0,
        .rxChannelIndex         = UDMA_SEC_CHANNEL_UART2RX_12,
        .txChannelIndex         = UDMA_SEC_CHANNEL_UART2TX_13,
        .channelMappingFxn      = uDMAChannelAssign,
        .rxChannelMappingFxnArg = UDMA_CH12_SSI2RX,
        .txChannelMappingFxnArg = UDMA_CH13_SSI2TX
    },
    {
        .baseAddr               = SSI3_BASE,
        .intNum                 = INT_SSI3,
        .intPriority            = (~0),
        .scratchBufPtr          = &spiTivaDMAscratchBuf[1],
        .defaultTxBufValue      = 0,
        .rxChannelIndex         = UDMA_SEC_CHANNEL_TMR2A_14,
        .txChannelIndex         = UDMA_SEC_CHANNEL_TMR2B_15,
        .channelMappingFxn      = uDMAChannelAssign,
        .rxChannelMappingFxnArg = UDMA_CH14_SSI3RX,
        .txChannelMappingFxnArg = UDMA_CH15_SSI3TX
    }
};

const SPI_Config SPI_config[] = {
    {
        .fxnTablePtr = &SPITivaDMA_fxnTable,
        .object      = &spiTivaDMAObjects[0],
        .hwAttrs     = &spiTivaDMAHWAttrs[0]
    },
    {
        .fxnTablePtr = &SPITivaDMA_fxnTable,
        .object      = &spiTivaDMAObjects[1],
        .hwAttrs     = &spiTivaDMAHWAttrs[1]
    },
    {NULL, NULL, NULL}
};

