rtzmicro/PMX42_TivaTM4C1294NCPDT/PMX42_TM4C1294NCPDT.c
/*
 *  ======== PMX42_initSPI ========
 */
void PMX42_initSPI(void)
{
	/* Enable SSI2 and SSI3 peripheral devices */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI2);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI3);

	/*
     * SSI2 (I/O Slots 1 & 2)
     */

	// Enable pin PD3 for SSI2 SSI2CLK
	GPIOPinConfigure(GPIO_PD3_SSI2CLK);
	GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_3);

#if 0
	/* THESE ARE FOR QUAD SPEED SPI */
	// Enable pin PD6 for SSI2 SSI2XDAT3
	GPIOPinConfigure(GPIO_PD6_SSI2XDAT3);
	GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_6);

	// Enable pin PD7 for SSI2 SSI2XDAT2
	// First open the lock and select the bits we want to modify in the GPIO commit register.
	HWREG(GPIO_PORTD_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY;
	HWREG(GPIO_PORTD_BASE + GPIO_O_CR) = 0x80;

	// Now modify the configuration of the pins that we unlocked.
	GPIOPinConfigure(GPIO_PD7_SSI2XDAT2);
	GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_7);
#endif
	// Enable pin PD1 for SSI2 SSI2XDAT0
	GPIOPinConfigure(GPIO_PD1_SSI2XDAT0);
	GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_1);

	// Enable pin PD0 for SSI2 SSI2XDAT1
	GPIOPinConfigure(GPIO_PD0_SSI2XDAT1);
	GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_0);

    /*
     * SSI3 (I/O Slots 3 & 4)
     */

    // Enable pin PQ3 for SSI3 SSI3XDAT1
    GPIOPinConfigure(GPIO_PQ3_SSI3XDAT1);
    GPIOPinTypeSSI(GPIO_PORTQ_BASE, GPIO_PIN_3);

    // Enable pin PQ2 for SSI3 SSI3XDAT0
    GPIOPinConfigure(GPIO_PQ2_SSI3XDAT0);
    GPIOPinTypeSSI(GPIO_PORTQ_BASE, GPIO_PIN_2);

#if 0
	/* THESE ARE FOR QUAD SPEED SPI */
    // Enable pin PP0 for SSI3 SSI3XDAT2
    GPIOPinConfigure(GPIO_PP0_SSI3XDAT2);
    GPIOPinTypeSSI(GPIO_PORTP_BASE, GPIO_PIN_0);

    // Enable pin PP1 for SSI3 SSI3XDAT3
    GPIOPinConfigure(GPIO_PP1_SSI3XDAT3);
    GPIOPinTypeSSI(GPIO_PORTP_BASE, GPIO_PIN_1);
#endif

    // Enable pin PQ0 for SSI3 SSI3CLK
    GPIOPinConfigure(GPIO_PQ0_SSI3CLK);
    GPIOPinTypeSSI(GPIO_PORTQ_BASE, GPIO_PIN_0);

    PMX42_initDMA();
    SPI_init();
}


/*
 *  =============================== UART ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(UART_config, ".const:UART_config")
#pragma DATA_SECTION(uartTivaHWAttrs, ".const:uartTivaHWAttrs")
#endif

#include <ti/drivers/UART.h>
#if TI_DRIVERS_UART_DMA
#include <ti/drivers/uart/UARTTivaDMA.h>

UARTTivaDMA_Object uartTivaObjects[PMX42_UARTCOUNT];

const UARTTivaDMA_HWAttrs uartTivaHWAttrs[PMX42_UARTCOUNT] = {
    {
        .baseAddr       = UART0_BASE,
        .intNum         = INT_UART0,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH8_UART0RX,
        .txChannelIndex = UDMA_CH9_UART0TX,
    },
    {
        .baseAddr       = UART3_BASE,
        .intNum         = INT_UART3,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH16_UART3RX,
        .txChannelIndex = UDMA_CH16_UART3TX,
    },
    {
        .baseAddr       = UART5_BASE,
        .intNum         = INT_UART5,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH6_UART5RX,
        .txChannelIndex = UDMA_CH7_UART5TX,
    },
    {
        .baseAddr       = UART7_BASE,
        .intNum         = INT_UART7,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH20_UART7RX,
        .txChannelIndex = UDMA_CH21_UART7TX,
    }
};

const UART_Config UART_config[] = {
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object      = &uartTivaObjects[0],
        .hwAttrs     = &uartTivaHWAttrs[0]
    },
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object      = &uartTivaObjects[1],
        .hwAttrs     = &uartTivaHWAttrs[1]
    },
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object      = &uartTivaObjects[2],
        .hwAttrs     = &uartTivaHWAttrs[2]
    },
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object      = &uartTivaObjects[3],
        .hwAttrs     = &uartTivaHWAttrs[3]
    },
    {NULL, NULL, NULL}
};
#else
#include <ti/drivers/uart/UARTTiva.h>

UARTTiva_Object uartTivaObjects[PMX42_UARTCOUNT];
unsigned char uartTivaRingBuffer[PMX42_UARTCOUNT][32];

/* UART configuration structure */
const UARTTiva_HWAttrs uartTivaHWAttrs[PMX42_UARTCOUNT] = {
    {
        .baseAddr    = UART0_BASE,
        .intNum      = INT_UART0,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[0],
        .ringBufSize = sizeof(uartTivaRingBuffer[0])
    },
    {
        .baseAddr    = UART3_BASE,
        .intNum      = INT_UART3,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[1],
        .ringBufSize = sizeof(uartTivaRingBuffer[1])
    },
    {
        .baseAddr    = UART5_BASE,
        .intNum      = INT_UART5,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[2],
        .ringBufSize = sizeof(uartTivaRingBuffer[2])
    },
    {
        .baseAddr    = UART7_BASE,
        .intNum      = INT_UART7,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[3],
        .ringBufSize = sizeof(uartTivaRingBuffer[3])
    }
};

const UART_Config UART_config[] = {
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object      = &uartTivaObjects[0],
        .hwAttrs     = &uartTivaHWAttrs[0]
    },
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object      = &uartTivaObjects[1],
        .hwAttrs     = &uartTivaHWAttrs[1]
    },
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object      = &uartTivaObjects[2],
        .hwAttrs     = &uartTivaHWAttrs[2]
    },
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object      = &uartTivaObjects[3],
        .hwAttrs     = &uartTivaHWAttrs[3]
    },
    {NULL, NULL, NULL}
};
#endif /* TI_DRIVERS_UART_DMA */

